doc/tutorial.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>A clojure2minizinc Tutorial</title>
<!-- 2014-09-30 Tue 19:40 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Torsten Anders" />
<link rel="stylesheet" type="text/css" href="http://thomasf.github.io/solarized-css/solarized-light.min.css" />


</head>
<body>
<div id="content">
<h1 class="title">A clojure2minizinc Tutorial</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Basic Modelling in MiniZinc</a>
<ul>
<li><a href="#sec-2-1">2.1. Defining a Namespace for the Tutorial</a></li>
<li><a href="#sec-2-2">2.2. Our First Example (MiniZinc tutorial, p. 3ff)</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. The Resulting MiniZinc Code</a></li>
<li><a href="#sec-2-2-2">2.2.2. Storing Variables in Other Data Structures</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. An Arithmetic Optimisation Example (MiniZinc tutorial, p. 6ff)</a></li>
<li><a href="#sec-2-4">2.4. Datafiles and Assertions (MiniZinc tutorial, p. 8ff)</a></li>
<li><a href="#sec-2-5">2.5. Real Number Solving (MiniZinc tutorial, p. 11ff)</a></li>
</ul>
</li>
<li><a href="#sec-3">3. More Complex Models</a>
<ul>
<li><a href="#sec-3-1">3.1. Arrays and Sets (MiniZinc tutorial, p. 15ff)</a></li>
<li><a href="#sec-3-2">3.2. <span class="todo TODO">TODO</span> Complete this Tutorial&#x2026;</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Similarity and Differences between MiniZinc and clojure2minizinc</a>
<ul>
<li><a href="#sec-4-1">4.1. Code Similarity</a></li>
<li><a href="#sec-4-2">4.2. Exceptions to the Similarity</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. <span class="todo TODO">TODO</span> Keep this Note Up To Date</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-5">5. What Makes clojure2minizinc Special?</a>
<ul>
<li><a href="#sec-5-1">5.1. Going Beyond MiniZinc Limitations</a>
<ul>
<li><a href="#sec-5-1-1">5.1.1. Integration in a General-Purpose Programming Language</a></li>
<li><a href="#sec-5-1-2">5.1.2. Higher-Order Programming</a></li>
</ul>
</li>
<li><a href="#sec-5-2">5.2. clojure2minizinc is Solver-Independent</a></li>
<li><a href="#sec-5-3">5.3. Pitfalls of Constraint Programming Compared to Standard Clojure Programming</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The <a href="http://clojure.org/">Clojure</a> library <i>clojure2minizinc</i> provides an interface to MiniZinc. <a href="http://www.minizinc.org/">MiniZinc</a> is a domain-specific language (DSL) for modelling constraint satisfaction and optimisation problems (CSP) over Boolean, integer, real number, and set variables. MiniZinc has the potential to become the lingua franca of the Constraint Programming community. For developers of existing constraint solvers it is rather easy to define a MiniZinc interface for their solvers, <a href="http://www.minizinc.org/software.html">several state-of-the-art solvers already support MiniZinc</a> via the simpler language FlatZinc (even more solvers listed <a href="http://www.hakank.org/minizinc/">here</a>), and they compete in a yearly <a href="http://www.minizinc.org/challenge.html">MiniZinc Challenge</a>. More information on MiniZinc, in particular many related links can be found at <a href="http://www.hakank.org/minizinc/">http://www.hakank.org/minizinc/</a>
</p>

<p>
In clojure2minizinc, CSPs are defined directly in Clojure. MiniZinc (and its constraint solvers, including 3rd-party solvers) do the actual work in the background, and the result is read back into Clojure. clojure2minizinc code can be very close to MiniZinc code, and therefore this tutorial complements the <a href="http://www.minizinc.org/downloads/doc-latest/minizinc-tute.pdf">MiniZinc tutorial</a>: its examples are translated into Clojure here. In addition to the translated examples, this tutorial primarily explains the differences between clojure2minizinc and MiniZinc. It also discusses how the power of Clojure can complement what MiniZinc provides.
</p>
</div>
</div>


<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Basic Modelling in MiniZinc</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Defining a Namespace for the Tutorial</h3>
<div class="outline-text-3" id="text-2-1">
<p>
MiniZinc is a highly specialised and rather small language. It lacks many features of standard programming languages. clojure2minizinc marries MiniZinc with Clojure and that way many concepts of general purpose languages (in the guise of their Clojure implementation) can be used for a MiniZinc program.
</p>

<p>
For example, a clojure2minizinc program is defined in a Clojure namespace. The following code block defines a namespace for this tutorial. Note that clojure2minizinc "overwrites" many standard Clojure functions. You may want to use the library with a namespace prefix. The definitions below uses the alias <code>mz</code> (for MiniZinc). 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">ns</span> <span style="color: #228b22;">clojure2minizinc.tutorial</span>
  (<span style="color: #008b8b;">:require</span> [<span style="color: #228b22;">clojure2minizinc.core</span> <span style="color: #008b8b;">:as</span> mz]  <span style="color: #b22222;">; </span><span style="color: #b22222;">loading clojure2minizinc.core </span>
            [<span style="color: #228b22;">clojure.pprint</span> <span style="color: #008b8b;">:as</span> pprint]))   <span style="color: #b22222;">; </span><span style="color: #b22222;">pprint is needed later...</span>
</pre>
</div>

<p>
The library <code>clojure.pprint</code> will be needed later. We already add them here for convenience.
</p>
</div>
</div>
