doc/tutorial.html


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Our First Example (MiniZinc tutorial, p. 3ff)</h3>
<div class="outline-text-3" id="text-2-2">

<p>
The first example defines a map-colouring of Australia. The <a href="http://www.minizinc.org/downloads/doc-latest/minizinc-tute.pdf">MiniZinc tutorial</a>, p. 3ff, motivates and explains this model. This tutorial assumes that you read the MiniZinc tutorial alongside. To help you with that, even the same headlines are used.
</p>

<p>
Notice that most functions in this example are in the <code>mz</code> namespace, but the decision variables (and an int) of the model are stored with the standard Clojure <code>let</code> form &#x2013; clojure2minizinc allows to store MiniZinc variables and parameters (constants) in arbitrary Clojure data structures.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">aust</span>
  (<span style="color: #228b22;">mz</span>/clj2mnz
   (<span style="color: #a020f0;">let</span> [nc (<span style="color: #228b22;">mz</span>/int 'nc 3)              <span style="color: #b22222;">; </span><span style="color: #b22222;">number of colours</span>
         wa (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 nc))  <span style="color: #b22222;">; </span><span style="color: #b22222;">7 variables for 7 states</span>
         nt (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 nc))
         sa (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 nc))
         q (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 nc))
         nsw (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 nc))
         v (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 nc))
         t (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 nc))]
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/!= wa nt))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/!= wa sa))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/!= nt sa))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/!= nt q))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/!= sa q))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/!= sa nsw))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/!= sa v))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/!= nsw v))
     (<span style="color: #228b22;">mz</span>/solve <span style="color: #008b8b;">:satisfy</span>)
     (<span style="color: #228b22;">mz</span>/output-map {<span style="color: #008b8b;">:wa</span> wa <span style="color: #008b8b;">:nt</span> nt <span style="color: #008b8b;">:sa</span> sa <span style="color: #008b8b;">:q</span> q <span style="color: #008b8b;">:nsw</span> nsw <span style="color: #008b8b;">:v</span> v <span style="color: #008b8b;">:t</span> t}))))
</pre>
</div>

<p>
We can solve this MiniZinc model as follows.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc aust)
</pre>
</div>

<p>
It returns the following result. Different numbers encode different colours on the map for the Australian states.
</p>

<p>
<code>; =&gt; ({:wa 1, :nt 2, :sa 3, :q 1, :nsw 2, :v 1, :t 1})</code>
</p>

<p>
In this example, a solution is wrapped in a Clojure map. You can ask for multiple solutions, if you like. 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc aust <span style="color: #008b8b;">:num-solutions</span> 3)
</pre>
</div>

<p>
<code>; =&gt; ({:wa 1, :nt 2, :sa 3, :q 1, :nsw 2, :v 1, :t 1} {:wa 2, :nt 1, :sa 3, :q 2, :nsw 2, :v 1, :t 1} {:wa 1, :nt 3, :sa 2, :q 1, :nsw 3, :v 1, :t 1})</code>
</p>


<p>
In fact, you can specify arbitrary options supported by the <code>minizinc</code> shell command. The next code line specifies to use (the FlatZinc interpreter of) <a href="http://www.gecode.org/flatzinc.html">Gecode</a> (which must of could be installed). This solver won many <a href="http://www.minizinc.org/challenge.html">MiniZinc Challenges</a> and is much more efficient than the solver that <code>minizinc</code> uses by default. For this simple model this makes no real difference (most time is spend on the <a href="http://ww2.cs.mu.oz.au/~sbrand/project/minizinc07.pdf">translation of MiniZinc to FlatZinc</a> here), but for more complex problems the difference can be huge.   
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc aust <span style="color: #008b8b;">:options</span> [<span style="color: #8b2252;">"-f fzn-gecode"</span>])
</pre>
</div>

<p>
The solution happens to be different, because different solvers may use different search strategies, which can lead to different first solutions. (MiniZinc also allows to specify the search strategy, <a href="http://www.minizinc.org/workshop2011/mzn2011_submission_1.pdf">within certain bounds</a>). 
</p>

<p>
<code>; =&gt; ({:wa 3, :nt 2, :sa 1, :q 3, :nsw 3, :v 2, :t 1})</code>  
</p>

<p>
In the next call we ask Gecode to use 8 threads and/or cores for a parallel search. Again, this makes only a real difference for more complex problems. 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc aust <span style="color: #008b8b;">:options</span> [<span style="color: #8b2252;">"-f fzn-gecode"</span> <span style="color: #8b2252;">"-p8"</span>])
</pre>
</div>

<p>
For more information on solver options see the help screen of <code>minizinc</code>. Type at a terminal.
</p>

<p>
<code>$ minizinc --help</code>
</p>
</div>


<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> The Resulting MiniZinc Code</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
The var <code>aust</code> binds a string created by the model above. This string is shown below (without surrounding double-quotes for simplicity). 
</p>

<pre class="example">
int: nc = 3;
var 1..nc: var4570;
var 1..nc: var4571;
var 1..nc: var4572;
var 1..nc: var4573;
var 1..nc: var4574;
var 1..nc: var4575;
var 1..nc: var4576;
constraint (var4570 != var4571);
constraint (var4570 != var4572);
constraint (var4571 != var4572);
constraint (var4571 != var4573);
constraint (var4572 != var4573);
constraint (var4572 != var4574);
constraint (var4572 != var4575);
constraint (var4574 != var4575);
solve satisfy;
output ["{", " :wa ", show(var4570), " :nt ", show(var4571), " :sa ", show(var4572), " :q ", show(var4573), " :nsw ", show(var4574), " :v ", show(var4575), " :t ", show(var4576), "}\n"];
</pre>

<p>
The string contains the generated MiniZinc code. Note the similarity between the model in Clojure and in MiniZinc. clojure2minizinc aims to be very similar to MiniZinc itself, so that the MiniZinc documentation can also document clojure2minizinc. Nevertheless, some differences are unavoidable. Obviously, clojure2minizinc uses Clojure syntax, and some functions names are illegal in Clojure (e.g., <code>var</code> is a special form, and clojure2minizinc must define the function <code>variable</code> instead).
</p>

<p>
The generated code is almost exactly the same as the MiniZinc model <code>aust.mzn</code> shown in Figure 2 of the tutorial, p. 4. The main difference is that the variable names in the code above are generated automatically (the names may look slightly different when you run this code). The function <code>mz/variable</code> simply does not know that its result is stored in a symbol by <code>let</code>, and thus does not know its name. If you are only interested in the Clojure code, this poses no problem, as you do not need to read the automatically generated MiniZinc variables. 
</p>

<p>
If you want better readable MiniZinc code, just explicitly tell <code>mz/variable</code> (or its friends like <code>mz/int</code>) your MiniZinc variable name. 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 10) 'x)
</pre>
</div>

<p>
The integer parameter of the model (<code>nc</code>) has been explicitly named this way (the optional name for the integer parameter is given before its optional initialisation value).
</p>

<p>
Section <i>Similarity and Differences between MiniZinc and clojure2minizinc</i> below details further differences between these two languages.
</p>
</div>
</div>
