doc/tutorial.html


<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Storing Variables in Other Data Structures</h4>
<div class="outline-text-4" id="text-2-2-2">

<p>
As mentioned above, clojure2minizinc can store MiniZinc variables and parameters in arbitrary Clojure data structures. The following example stores the variables for the colours of Australian states in a map. The same inequality constraints are applied by mapping over pairs of keywords representing these inequalities somewhat more concisely. 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc 
 (<span style="color: #228b22;">mz</span>/clj2mnz
  (<span style="color: #a020f0;">let</span> [nc (<span style="color: #228b22;">mz</span>/int 'nc 3)
        states (zipmap [<span style="color: #008b8b;">:wa</span> <span style="color: #008b8b;">:nt</span> <span style="color: #008b8b;">:sa</span> <span style="color: #008b8b;">:q</span> <span style="color: #008b8b;">:nsw</span> <span style="color: #008b8b;">:v</span> <span style="color: #008b8b;">:t</span>]
                       (take 7 (repeatedly #(<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 nc)))))]
    (<span style="color: #a020f0;">doall</span> (map (<span style="color: #a020f0;">fn</span> [[s1 s2]] 
                  (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/!= (s1 states) (s2 states))))
                [[<span style="color: #008b8b;">:wa</span> <span style="color: #008b8b;">:nt</span>] [<span style="color: #008b8b;">:wa</span> <span style="color: #008b8b;">:sa</span>] [<span style="color: #008b8b;">:nt</span> <span style="color: #008b8b;">:sa</span>] [<span style="color: #008b8b;">:nt</span> <span style="color: #008b8b;">:q</span>] [<span style="color: #008b8b;">:sa</span> <span style="color: #008b8b;">:q</span>] [<span style="color: #008b8b;">:sa</span> <span style="color: #008b8b;">:nsw</span>] [<span style="color: #008b8b;">:sa</span> <span style="color: #008b8b;">:v</span>] [<span style="color: #008b8b;">:nsw</span> <span style="color: #008b8b;">:v</span>]]))
    (<span style="color: #228b22;">mz</span>/solve <span style="color: #008b8b;">:satisfy</span>)
    (<span style="color: #228b22;">mz</span>/output-map states))))
</pre>
</div>

<p>
The resulting MiniZinc code is basically the same, and thus also the result.
</p>
</div>
</div>
</div>


<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> An Arithmetic Optimisation Example (MiniZinc tutorial, p. 6ff)</h3>
<div class="outline-text-3" id="text-2-3">

<p>
The MiniZinc tutorial continues with an optimisation example, that computes the number of banana (<code>b</code>) and chocolate (<code>c</code>) cakes to bake for maximum profit given the recipes for these cakes, the amount of ingredients, and the price at which each cake can be sold. 
</p>

<p>
The corresponding clojure2minizinc code is shown below. Please see the MiniZinc tutorial for an explanation of this model. 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc 
 (<span style="color: #228b22;">mz</span>/clj2mnz
  (<span style="color: #a020f0;">let</span> [b (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 100))
        c (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 100))]
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">flour</span>
    (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/&lt;= (<span style="color: #228b22;">mz</span>/+ (<span style="color: #228b22;">mz</span>/* 250 b)
                                (<span style="color: #228b22;">mz</span>/* 200 c))
                          4000))
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">bananas</span>
    (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/&lt;= (<span style="color: #228b22;">mz</span>/* 2 b) 6))
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">sugar</span>
    (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/&lt;= (<span style="color: #228b22;">mz</span>/+ (<span style="color: #228b22;">mz</span>/* 75 b)
                                (<span style="color: #228b22;">mz</span>/* 150 c))
                          2000))
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">butter </span>
    (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/&lt;= (<span style="color: #228b22;">mz</span>/+ (<span style="color: #228b22;">mz</span>/* 100 b)
                                (<span style="color: #228b22;">mz</span>/* 150 c))
                          500))
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">cocoa</span>
    (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/&lt;= (<span style="color: #228b22;">mz</span>/* 75 c) 500))
    <span style="color: #b22222;">;; </span><span style="color: #b22222;">maximise profit</span>
    (<span style="color: #228b22;">mz</span>/solve <span style="color: #008b8b;">:maximize</span> (<span style="color: #228b22;">mz</span>/+ (<span style="color: #228b22;">mz</span>/* 400 b) (<span style="color: #228b22;">mz</span>/* 450 c)))
    (<span style="color: #228b22;">mz</span>/output-map {<span style="color: #008b8b;">:banana-cakes</span> b <span style="color: #008b8b;">:chocolate-cakes</span> c}))))
</pre>
</div>

<p>
The optimal solution are two cakes of each kind. 
</p>

<p>
<code>; =&gt; ({:banana-cakes 2, :chocolate-cakes 2})</code>
</p>
</div>
</div>
