doc/tutorial.html


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Datafiles and Assertions (MiniZinc tutorial, p. 8ff)</h3>
<div class="outline-text-3" id="text-2-4">

<p>
In the previous example, the amount of each ingredient was fixed in the model. MiniZinc supports parameterising models, where MiniZinc parameters or variables are declared but not further initialised. Values for this parameters/variables are specified outside of the model to the solver, usually with MiniZinc data files. 
</p>

<p>
The clojure2minizinc version of the parameterised model is shown below. Again, please see the MiniZinc tutorial (p. 8ff) for an explanation of this model. 
</p>

<p>
Note that we must specify explicit names for the parameters of a parameterised model (here <code>flour</code>, <code>banana</code>, <code>sugar</code>, and so forth), so that these names are the same as in the parameter file (i.e., automatically generated names would not work).
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">cakes2</span>
  (<span style="color: #228b22;">mz</span>/clj2mnz
   (<span style="color: #a020f0;">let</span> [flour (<span style="color: #228b22;">mz</span>/int 'flour)
         banana (<span style="color: #228b22;">mz</span>/int 'banana)
         sugar (<span style="color: #228b22;">mz</span>/int 'sugar)
         butter (<span style="color: #228b22;">mz</span>/int 'butter)
         cocoa (<span style="color: #228b22;">mz</span>/int 'cocoa)]
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/assert (<span style="color: #228b22;">mz</span>/&gt;= flour 0) <span style="color: #8b2252;">"Amount of flour must not be negative"</span>))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/assert (<span style="color: #228b22;">mz</span>/&gt;= banana 0) <span style="color: #8b2252;">"Amount of banana must not be negative"</span>))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/assert (<span style="color: #228b22;">mz</span>/&gt;= sugar 0) <span style="color: #8b2252;">"Amount of sugar must not be negative"</span>))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/assert (<span style="color: #228b22;">mz</span>/&gt;= butter 0) <span style="color: #8b2252;">"Amount of butter must not be negative"</span>))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/assert (<span style="color: #228b22;">mz</span>/&gt;= cocoa 0) <span style="color: #8b2252;">"Amount of cocoa must not be negative"</span>))
     (<span style="color: #a020f0;">let</span> [b (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 100))
           c (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 1 100))]
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">flour</span>
       (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/&lt;= (<span style="color: #228b22;">mz</span>/+ (<span style="color: #228b22;">mz</span>/* 250 b)
                                   (<span style="color: #228b22;">mz</span>/* 200 c))
                             flour))
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">bananas</span>
       (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/&lt;= (<span style="color: #228b22;">mz</span>/* 2 b) banana))
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">sugar</span>
       (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/&lt;= (<span style="color: #228b22;">mz</span>/+ (<span style="color: #228b22;">mz</span>/* 75 b)
                                   (<span style="color: #228b22;">mz</span>/* 150 c))
                             sugar))
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">butter </span>
       (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/&lt;= (<span style="color: #228b22;">mz</span>/+ (<span style="color: #228b22;">mz</span>/* 100 b)
                                   (<span style="color: #228b22;">mz</span>/* 150 c))
                             butter))
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">cocoa</span>
       (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/&lt;= (<span style="color: #228b22;">mz</span>/* 75 c) cocoa))
       <span style="color: #b22222;">;; </span><span style="color: #b22222;">maximise profit</span>
       (<span style="color: #228b22;">mz</span>/solve <span style="color: #008b8b;">:maximize</span> (<span style="color: #228b22;">mz</span>/+ (<span style="color: #228b22;">mz</span>/* 400 b) (<span style="color: #228b22;">mz</span>/* 450 c)))
       (<span style="color: #228b22;">mz</span>/output-map {<span style="color: #008b8b;">:banana-cakes</span> b <span style="color: #008b8b;">:chocolate-cakes</span> c})))))
</pre>
</div>


<p>
In clojure2minizinc, the parameters for a model are given directly to the solver. The code below specifies the same amounts of ingredients for the cakes as the original example, and therefore the result is the same. 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc cakes2
  <span style="color: #008b8b;">:data</span> (<span style="color: #228b22;">mz</span>/map2minizinc {<span style="color: #008b8b;">:flour</span> 4000 <span style="color: #008b8b;">:banana</span> 6 <span style="color: #008b8b;">:sugar</span> 2000 <span style="color: #008b8b;">:butter</span> 500 <span style="color: #008b8b;">:cocoa</span> 500}))
</pre>
</div>

<p>
<code>; =&gt; ({:banana-cakes 2, :chocolate-cakes 2})</code>
</p>

<p>
Different amounts have a different optimal result.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc cakes2
  <span style="color: #008b8b;">:data</span> (<span style="color: #228b22;">mz</span>/map2minizinc {<span style="color: #008b8b;">:flour</span> 8000 <span style="color: #008b8b;">:banana</span> 11 <span style="color: #008b8b;">:sugar</span> 3000 <span style="color: #008b8b;">:butter</span> 1500 <span style="color: #008b8b;">:cocoa</span> 800}))
</pre>
</div>

<p>
<code>; =&gt;  ({:banana-cakes 3, :chocolate-cakes 8})</code>
</p>
</div>
</div>
