doc/tutorial.html


<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Real Number Solving (MiniZinc tutorial, p. 11ff)</h3>
<div class="outline-text-3" id="text-2-5">

<p>
The next example demonstrates constraint programming on "real numbers" (floating point variables). The example models the repayment of a loan with interest over four quarters.
</p>

<p>
The model is also parameterised &#x2013; values for variables <code>r</code>, <code>p</code> and so forth can be specified to the solver. Remember that we must specify explicit names for these variables (they should not be named automatically).
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">def</span> <span style="color: #a0522d;">loan</span>
  (<span style="color: #228b22;">mz</span>/clj2mnz
   (<span style="color: #a020f0;">let</span> [r (<span style="color: #228b22;">mz</span>/variable <span style="color: #008b8b;">:float</span> 'r)           <span style="color: #b22222;">; </span><span style="color: #b22222;">quarterly repayment</span>
         p (<span style="color: #228b22;">mz</span>/variable <span style="color: #008b8b;">:float</span> 'p)           <span style="color: #b22222;">; </span><span style="color: #b22222;">principal initially borrowed</span>
         i (<span style="color: #228b22;">mz</span>/variable (<span style="color: #228b22;">mz</span>/-- 0.0 10.0) 'i) <span style="color: #b22222;">; </span><span style="color: #b22222;">interest rate</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">intermediate variables </span>
         b1 (<span style="color: #228b22;">mz</span>/variable <span style="color: #008b8b;">:float</span> 'b1)         <span style="color: #b22222;">; </span><span style="color: #b22222;">balance after one quarter</span>
         b2 (<span style="color: #228b22;">mz</span>/variable <span style="color: #008b8b;">:float</span> 'b2)         <span style="color: #b22222;">; </span><span style="color: #b22222;">balance after two quarters</span>
         b3 (<span style="color: #228b22;">mz</span>/variable <span style="color: #008b8b;">:float</span> 'b3)         <span style="color: #b22222;">; </span><span style="color: #b22222;">balance after three quarters</span>
         b4 (<span style="color: #228b22;">mz</span>/variable <span style="color: #008b8b;">:float</span> 'b4)]        <span style="color: #b22222;">; </span><span style="color: #b22222;">balance owing at end</span>
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= b1 (<span style="color: #228b22;">mz</span>/- (<span style="color: #228b22;">mz</span>/* p (<span style="color: #228b22;">mz</span>/+ 1.0 i)) r)))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= b2 (<span style="color: #228b22;">mz</span>/- (<span style="color: #228b22;">mz</span>/* b1 (<span style="color: #228b22;">mz</span>/+ 1.0 i)) r)))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= b3 (<span style="color: #228b22;">mz</span>/- (<span style="color: #228b22;">mz</span>/* b2 (<span style="color: #228b22;">mz</span>/+ 1.0 i)) r)))
     (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= b4 (<span style="color: #228b22;">mz</span>/- (<span style="color: #228b22;">mz</span>/* b3 (<span style="color: #228b22;">mz</span>/+ 1.0 i)) r)))
     (<span style="color: #228b22;">mz</span>/solve <span style="color: #008b8b;">:satisfy</span>)
     (<span style="color: #228b22;">mz</span>/output-map {<span style="color: #008b8b;">:borrowing</span> p <span style="color: #008b8b;">:interest-rate</span> (<span style="color: #228b22;">mz</span>/* i 100.0)
                     <span style="color: #008b8b;">:repayment-per-quarter</span> r
                     <span style="color: #008b8b;">:owing-at-end</span> b4}))))
</pre>
</div>

<p>
The default MiniZinc solver (<code>mzn-g12fd</code>) does not support floating point variables, so we can use Gecode again. A solution is shown below the solver call.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc loan <span style="color: #008b8b;">:options</span> [<span style="color: #8b2252;">"-f fzn-gecode"</span>] 
  <span style="color: #008b8b;">:data</span> (<span style="color: #228b22;">mz</span>/map2minizinc {<span style="color: #008b8b;">:i</span> 0.04 <span style="color: #008b8b;">:p</span> 1000.0 <span style="color: #008b8b;">:r</span> 260.0}))
</pre>
</div>

<p>
<code>; =&gt; ({:borrowing 1000.0, :interest-rate 4.00000000000001, :repayment-per-quarter 260.0, :owing-at-end 65.7779200000003})</code>
</p>

<p>
In constraint programming any variable can be quasi input or output of the algorithm. Instead of setting the values for <code>r</code>, <code>p</code> and <code>i</code> in the solver call, we can set the values for other variables. By setting <code>b4</code> to 0 we specify that the loan is fully payed back after four quarters.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc loan <span style="color: #008b8b;">:options</span> [<span style="color: #8b2252;">"-f fzn-gecode"</span>] 
  <span style="color: #008b8b;">:data</span> (<span style="color: #228b22;">mz</span>/map2minizinc {<span style="color: #008b8b;">:i</span> 0.04 <span style="color: #008b8b;">:p</span> 1000.0 <span style="color: #008b8b;">:b4</span> 0.0}))
</pre>
</div>

<p>
<code>; =&gt; ({:borrowing 1000.0, :interest-rate 4.00000000000001, :repayment-per-quarter 275.490045364803, :owing-at-end 0.0})</code>
</p>

<p>
Here are again other variables set before the search.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc loan <span style="color: #008b8b;">:options</span> [<span style="color: #8b2252;">"-f fzn-gecode"</span>] 
  <span style="color: #008b8b;">:data</span> (<span style="color: #228b22;">mz</span>/map2minizinc {<span style="color: #008b8b;">:i</span> 0.04 <span style="color: #008b8b;">:r</span> 250.0 <span style="color: #008b8b;">:b4</span> 0.0}))
</pre>
</div>

<p>
<code>; =&gt; ({:borrowing 907.473806064214, :interest-rate 4.00000000000001, :repayment-per-quarter 250.0, :owing-at-end 0.0})</code>
</p>


<p>
If you do not have Gecode installed, you can also use the solver <code>mzn-g12mip</code>, which comes with MiniZinc. The result happens to be slightly different.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc loan <span style="color: #008b8b;">:solver</span> <span style="color: #8b2252;">"mzn-g12mip"</span>
  <span style="color: #008b8b;">:data</span> (<span style="color: #228b22;">mz</span>/map2minizinc {<span style="color: #008b8b;">:i</span> 0.04 <span style="color: #008b8b;">:r</span> 250.0 <span style="color: #008b8b;">:b4</span> 0.0}))
</pre>
</div>

<p>
<code>; =&gt; ({:borrowing 907.4738060642132, :interest-rate 4.0, :repayment-per-quarter 250.0, :owing-at-end 0.0})</code>
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> More Complex Models</h2>
