doc/tutorial.html
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Arrays and Sets (MiniZinc tutorial, p. 15ff)</h3>
<div class="outline-text-3" id="text-3-1">

<p>
This example demonstrates the use of a two-dimensional array of float variables. It models temperatures on a rectangular sheet of metal. The MiniZinc tutorial explains the details. 
</p>

<p>
In order to make the result better comprehensible, we will print it in table form instead of just returning the result. We need an auxiliary function that prints a table. Lets use <code>print-table</code> that is shown as an example for <code>get-pretty-writer</code> at <a href="http://clojure.github.io/clojure/clojure.pprint-api.html"><a href="http://clojure.github.io">http://clojure.github.io</a></a> (<code>print-table</code> is only slightly edited here). This function is the reason why we <code>require</code>'d <code>clojure.pprint</code> in the name space definition above.
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">defn</span> <span style="color: #0000ff;">print-table</span> [column-width aseq]
  (<span style="color: #a020f0;">binding</span> [<span style="color: #483d8b;">*out*</span> (<span style="color: #228b22;">pprint</span>/get-pretty-writer <span style="color: #483d8b;">*out*</span>)]
    (<span style="color: #a020f0;">doseq</span> [row aseq]
      (<span style="color: #a020f0;">doseq</span> [col row]
        (<span style="color: #228b22;">pprint</span>/cl-format <span style="color: #008b8b;">true</span> <span style="color: #8b2252;">"~6,2F~7,vT"</span> col column-width))
      (prn))))
</pre>
</div>

<p>
Now we can present the clojure2minizinc version of the Laplace model from the MiniZinc tutorial. 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #a020f0;">let</span> [width 5
      height 5]
  (print-table 2
   (partition (+ 1 height)  <span style="color: #b22222;">;; </span><span style="color: #b22222;">add one, because array boundaries are [0, height] etc.</span>
    (first 
     (<span style="color: #228b22;">mz</span>/minizinc 
      (<span style="color: #228b22;">mz</span>/clj2mnz
       (<span style="color: #a020f0;">let</span> [w (<span style="color: #228b22;">mz</span>/int 'w width)
             h (<span style="color: #228b22;">mz</span>/int 'h height)
             <span style="color: #b22222;">;; </span><span style="color: #b22222;">array decl</span>
             t (<span style="color: #228b22;">mz</span>/array (list (<span style="color: #228b22;">mz</span>/-- 0 w) (<span style="color: #228b22;">mz</span>/-- 0 h)) [<span style="color: #008b8b;">:var</span> <span style="color: #008b8b;">:float</span>] 't)
             left (<span style="color: #228b22;">mz</span>/variable <span style="color: #008b8b;">:float</span> 'left)
             right (<span style="color: #228b22;">mz</span>/variable <span style="color: #008b8b;">:float</span> 'right)
             top (<span style="color: #228b22;">mz</span>/variable <span style="color: #008b8b;">:float</span> 'top)
             bottom (<span style="color: #228b22;">mz</span>/variable <span style="color: #008b8b;">:float</span> 'bottom)]
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">Laplace equation</span>
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">Each internal temp. is average of its neighbours</span>
         (<span style="color: #228b22;">mz</span>/constraint 
          (<span style="color: #228b22;">mz</span>/forall [i (<span style="color: #228b22;">mz</span>/-- 1 (<span style="color: #228b22;">mz</span>/- w 1))
                      j (<span style="color: #228b22;">mz</span>/-- 1 (<span style="color: #228b22;">mz</span>/- h 1))]
                     (<span style="color: #228b22;">mz</span>/= (<span style="color: #228b22;">mz</span>/* 4.0 (<span style="color: #228b22;">mz</span>/nth t i j))
                           <span style="color: #b22222;">;; </span><span style="color: #b22222;">Constraints like + support an arbitray number of arguments </span>
                           (<span style="color: #228b22;">mz</span>/+ (<span style="color: #228b22;">mz</span>/nth t (<span style="color: #228b22;">mz</span>/- i 1) j)
                                 (<span style="color: #228b22;">mz</span>/nth t i (<span style="color: #228b22;">mz</span>/- j 1))
                                 (<span style="color: #228b22;">mz</span>/nth t (<span style="color: #228b22;">mz</span>/+ i 1) j)
                                 (<span style="color: #228b22;">mz</span>/nth t i (<span style="color: #228b22;">mz</span>/+ j 1))))))
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">edge constraints</span>
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/forall [i (<span style="color: #228b22;">mz</span>/-- 1 (<span style="color: #228b22;">mz</span>/- w 1))]
                                   (<span style="color: #228b22;">mz</span>/= (<span style="color: #228b22;">mz</span>/nth t i 0) left)))
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/forall [i (<span style="color: #228b22;">mz</span>/-- 1 (<span style="color: #228b22;">mz</span>/- w 1))]
                                   (<span style="color: #228b22;">mz</span>/= (<span style="color: #228b22;">mz</span>/nth t i h) right)))
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/forall [j (<span style="color: #228b22;">mz</span>/-- 1 (<span style="color: #228b22;">mz</span>/- h 1))]
                                   (<span style="color: #228b22;">mz</span>/= (<span style="color: #228b22;">mz</span>/nth t 0 j) top)))
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/forall [j (<span style="color: #228b22;">mz</span>/-- 1 (<span style="color: #228b22;">mz</span>/- h 1))]
                                   (<span style="color: #228b22;">mz</span>/= (<span style="color: #228b22;">mz</span>/nth t w j) bottom)))
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">corner constraints</span>
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= (<span style="color: #228b22;">mz</span>/nth t 0 0) 0.0))
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= (<span style="color: #228b22;">mz</span>/nth t 0 h) 0.0))
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= (<span style="color: #228b22;">mz</span>/nth t w 0) 0.0))
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= (<span style="color: #228b22;">mz</span>/nth t w h) 0.0))
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= left 0.0))
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= right 0.0))
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= top 100.0))
         (<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/= bottom 0.0))
         (<span style="color: #228b22;">mz</span>/solve <span style="color: #008b8b;">:satisfy</span>)
         <span style="color: #b22222;">;; </span><span style="color: #b22222;">2d-array output as flat 1d array -- formatting of result done by Clojure</span>
         (<span style="color: #228b22;">mz</span>/output-var t) 
         ))
      <span style="color: #008b8b;">:options</span> [<span style="color: #8b2252;">"-f fzn-gecode"</span>]
      <span style="color: #b22222;">; </span><span style="color: #b22222;">:solver "mzn-g12mip"</span>
      )))))
</pre>
</div>

<p>
In this model, the top-level call is <code>print-table</code>. The model therefore returns only <code>nil</code>, but prints the following result at the REPL.
</p>

<pre class="example">
  0.00 100.00  100.00  100.00  100.00    0.00  
  0.00  45.45   59.47   59.47   45.45    0.00  
  0.00  22.35   32.95   32.95   22.35    0.00  
  0.00  10.98   17.05   17.05   10.98    0.00  
  0.00   4.55    7.20    7.20    4.55    0.00  
  0.00   0.00    0.00    0.00    0.00    0.00
</pre>

<p>
Note that in the actual Laplace equation in the code above, the <code>mz/+</code> constraint takes four arguments. Unlike MiniZinc, where such arithmetic operators are only binary (infix operators), their clojure2minizinc counterparts support an arbitrary number of arguments, in true Lisp spirit.  
</p>
</div>
</div>


<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> Complete this Tutorial&#x2026;</h3>
<div class="outline-text-3" id="text-3-2">
<p>
However, you can already move on to the next section&#x2026;
</p>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Similarity and Differences between MiniZinc and clojure2minizinc</h2>
<div class="outline-text-2" id="text-4">
<p>
Definitions in clojure2minizinc can be very similar to MiniZinc code. But there are some differences, which are detailed here.
</p>
</div>


<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Code Similarity</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The syntax of MiniZinc and clojure2minizinc differs clearly. The MiniZinc notation is close to an ASCII version of standard math notation, while in clojure2minizinc all code is expressed by standard Lisp S-expressions. 
</p>

<p>
Nevertheless, most MiniZinc operators, functions etc. are called exactly the same in clojure2minizinc. For example the following two code snippets show a MiniZinc code line and the corresponding clojure2minizinc code (without namespace prefixes).
</p>

<pre class="example">
constraint x + y != z;
</pre>

<div class="org-src-container">

<pre class="src src-clojure">(constraint (!= (+ x y) z))
</pre>
</div>

<p>
Because of this similarity of code, the main documentation of clojure2minizinc is the MiniZinc documentation itself.
</p>
</div>
</div>
