doc/tutorial.org
** Exceptions to the Similarity

   There are a few exceptions, where certain MiniZinc operator etc. names cannot be translated into Clojure due to certain restrictions of Clojure. The differences between MiniZinc operators, keywords etc. and the corresponding Clojure functions are listed in the table below.

   | MiniZinc                                           | clojure2minizinc                                   |
   |----------------------------------------------------+----------------------------------------------------|
   | =var=                                              | =variable=, and special syntax                     |
   | =..=                                               | =--=                                               |
   | =/\=                                               | =and=                                              |
   | =\/=                                               | =or=                                               |
   | =array=                                            | special syntax                                     |
   | aggregation functions:  =forall=, =exists=, =xorall=, =iffall=, =sum=, =product=, =max=, =min= | special syntax                                     |
   | aggregation functions overload unary functions: =exists=, =sum=, =product=, =max=, =min= | unary functions: =exists*=, =sum*=, =product*=, =max*=, =min*= |
   |                                                    |                                                    |
   | <50>                                               | <50>                                               |


*** TODO Keep this Note Up To Date

    Note also that not all MiniZinc operators, keywords etc. are supported in the early releases of clojure2minizinc yet. For example, the table below will grow once the MiniZinc =let= and =if= are supported (both need different clojure2minizinc names as well). Also, in future versions many binary MiniZinc operators will be n-ary in clojure2minizinc.

    Further, an equivalent for the MiniZinc =output= does not exist, use =output-map= instead.
    


* What Makes clojure2minizinc Special?

** Going Beyond MiniZinc Limitations

*** Integration in a General-Purpose Programming Language
     
    clojure2minizinc allows you to do a number of things that are impossible (or at least much more difficult) in plain MiniZinc. MiniZinc is a highly specialised domain-specific language. clojure2minizinc is embedded in a general-purpose programming language and complements MiniZinc by standard programming features such as input/output, graphical user-interfaces, interfaces to the underlying operating system, and so forth. Basically, all Clojure and Java libraries are at your disposal when using clojure2minizinc. Also, the functionality of Clojure editors available for defining MiniZinc models. For example, auto-completion and documentation accessible in your editor will help you ([[http://www.minizinc.org/ide/index.html][MiniZinc editors]] do not support such functionality).

     Perhaps most importantly, constraint problems can be created dynamically (before the search starts). For example, a constraint problem may depend on user input. Imagine a scheduling problem where different kinds of tasks to schedule are represented by different arrays, and depending on user input you may need a few additional arrays. While MiniZinc already provides some means for abstraction (predicates and functions), these are restricted in their capabilities. Adding a few global arrays is at least difficult: MiniZinc data structures cannot be nested, so the result of a function could at most be one array (but it could be multi-dimensional). By contrast, clojure2minizinc makes it easy to create constraint problems dynamically -- Lisps are very good at generating code on the fly.

     It was mentioned already above that decision variables can be stored in arbitrary Clojure data structures, and then constraints be applied to these data structures (see section [[*Storing%20Variables%20in%20Other%20Data%20Structures][Storing Variables in Other Data Structures]]). MiniZinc does not see the Clojure data structure, but it may help to express information about the constraint problem to model (e.g., to express how certain variables are related).  


*** Higher-Order Programming

    Being integrated in a functional language, clojure2minizinc allows for higher-order programming. The following example maps a constraint (wrapped in a function) to all elements of a MiniZinc array (translated into a Clojure sequence). 

#+begin_src clojure 
(map #(mz/constraint (mz/< (mz/+ % 1) 10))
     (mz/array->clj-seq (array (-- 1 3) [:var (-- -100 100)])))
#+end_src

    To make such higher-order programming working, in the resulting MiniZinc program the array element are accessed one by one.

#+begin_example
array[1..3] of var -100..100: array9289;
constraint ((array9289[1] + 1) < 10);
constraint ((array9289[2] + 1) < 10);
constraint ((array9289[3] + 1) < 10);
#+end_example

    To be fair, using the MiniZinc aggregation function =forall= the example above can also be expressed very concisely. 

#+begin_example
array[1..3] of var -100..100: x;
constraint forall(i in 1..3)((x[i] + 1) < 10);
#+end_example

    The difference is that the set of such aggregation functions and their capabilities is fixed in MiniZinc, but the clojure2minizinc user can define her own special-purpose higher-order function for applying constraints. 

    *TODO: show example*

    Of course, such higher-order functions can only depend on information available before the search starts. For example, it is not possible to define a filtering function as part of the constraint problem, which depends on the values of variables in the solution. Anyway, higher-order functions can apply constraints that depend on whether other constraints hold, using reified constraints such as implication. 

    
