doc/tutorial.html


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Exceptions to the Similarity</h3>
<div class="outline-text-3" id="text-4-2">
<p>
There are a few exceptions, where certain MiniZinc operator etc. names cannot be translated into Clojure due to certain restrictions of Clojure. The differences between MiniZinc operators, keywords etc. and the corresponding Clojure functions are listed in the table below.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">MiniZinc</th>
<th scope="col" class="left">clojure2minizinc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>var</code></td>
<td class="left"><code>variable</code>, and special syntax</td>
</tr>

<tr>
<td class="left"><code>..</code></td>
<td class="left"><code>--</code></td>
</tr>

<tr>
<td class="left"><code>/\</code></td>
<td class="left"><code>and</code></td>
</tr>

<tr>
<td class="left"><code>\/</code></td>
<td class="left"><code>or</code></td>
</tr>

<tr>
<td class="left"><code>array</code></td>
<td class="left">special syntax</td>
</tr>

<tr>
<td class="left">list comprehension</td>
<td class="left"><code>aggregate</code>, and special syntax</td>
</tr>

<tr>
<td class="left">aggregation functions:  <code>forall</code>, <code>exists</code>, <code>xorall</code>, <code>iffall</code>, <code>sum</code>, <code>product</code>, <code>max</code>, <code>min</code></td>
<td class="left">special syntax</td>
</tr>

<tr>
<td class="left">aggregation functions overload unary functions: <code>exists</code>, <code>sum</code>, <code>product</code>, <code>max</code>, <code>min</code></td>
<td class="left">unary functions: <code>exists*</code>, <code>sum*</code>, <code>product*</code>, <code>max*</code>, <code>min*</code></td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>


<p>
Several literal Clojure types can be used directly in clojure2minizinc for corresponding literal MiniZinc parameter types. The exception are Clojure strings.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">MiniZinc</th>
<th scope="col" class="left">clojure2minizinc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left"><code>42</code></td>
<td class="left"><code>42</code></td>
</tr>

<tr>
<td class="left"><code>3.14</code></td>
<td class="left"><code>3.14</code></td>
</tr>

<tr>
<td class="left"><code>true</code></td>
<td class="left"><code>true</code></td>
</tr>

<tr>
<td class="left"><code>[1, 2, 3]</code></td>
<td class="left"><code>[1 2 3]</code></td>
</tr>

<tr>
<td class="left"><code>{1, 2, 3}</code></td>
<td class="left"><code>#{1 2 3}</code></td>
</tr>

<tr>
<td class="left">"my string"</td>
<td class="left"><code>(string "my string")</code></td>
</tr>
</tbody>
</table>


<p>
Two-dimensional MiniZinc arrays can be encoded by nested Clojure vectors. The nested vectors
</p>

<div class="org-src-container">

<pre class="src src-clojure">[[1.0 2.0] [3.0 4.0]]
</pre>
</div>

<p>
corresponds to the MiniZinc code
</p>

<div class="org-src-container">

<pre class="src src-minizinc">[| 1.0, 2.0 | 3.0, 4.0 |]
</pre>
</div>
</div>


<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> <span class="todo TODO">TODO</span> Keep this Note Up To Date</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Note also that not all MiniZinc operators, keywords etc. are supported in the early releases of clojure2minizinc yet. For example, the table below will grow once the MiniZinc <code>let</code> and <code>if</code> are supported (both need different clojure2minizinc names as well). Also, in future versions many binary MiniZinc operators will be n-ary in clojure2minizinc.
</p>

<p>
Further, an equivalent for the MiniZinc <code>output</code> does not exist, use <code>output-map</code> instead.
</p>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> What Makes clojure2minizinc Special?</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Going Beyond MiniZinc Limitations</h3>
<div class="outline-text-3" id="text-5-1">
</div><div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1"><span class="section-number-4">5.1.1</span> Integration in a General-Purpose Programming Language</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
clojure2minizinc allows you to do a number of things that are impossible (or at least much more difficult) in plain MiniZinc. MiniZinc is a highly specialised domain-specific language. clojure2minizinc is embedded in a general-purpose programming language and complements MiniZinc by standard programming features such as input/output, graphical user-interfaces, interfaces to the underlying operating system, and so forth. Basically, all Clojure and Java libraries are at your disposal when using clojure2minizinc. Also, the functionality of Clojure editors are available for defining MiniZinc models. For example, auto-completion and documentation accessible in your editor will help you (<a href="http://www.minizinc.org/ide/index.html">MiniZinc editors</a> do not support such functionality).
</p>

<p>
Perhaps most importantly, constraint problems can be created dynamically (before the search starts). For example, a constraint problem may depend on user input. Imagine a scheduling problem where different kinds of tasks to schedule are represented by different arrays, and depending on user input you may need a few additional arrays. While MiniZinc already provides some means for abstraction (predicates and functions), these are restricted in their capabilities. Adding a few global arrays dynamically depending on user input is at least difficult: MiniZinc data structures cannot be nested, so the result of a function could at most be one array (but it could be multi-dimensional). By contrast, clojure2minizinc makes it easy to create constraint problems dynamically &#x2013; Lisps are very good at generating code on the fly.
</p>

<p>
It was mentioned already above that decision variables can be stored in arbitrary Clojure data structures, and then constraints are applied to these data structures (see section <i>Storing Variables in Other Data Structures</i>). MiniZinc does not see the Clojure data structure, but your Clojure data structure may help to express information about the constraint problem to model (e.g., to express how certain variables are related).  
</p>
</div>
</div>


<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2"><span class="section-number-4">5.1.2</span> Higher-Order Programming</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
Being integrated in a functional language, clojure2minizinc allows for higher-order programming. The following example maps a constraint (wrapped in a function) to all elements of a MiniZinc array (translated into a Clojure sequence). 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(map #(<span style="color: #228b22;">mz</span>/constraint (<span style="color: #228b22;">mz</span>/&lt; (<span style="color: #228b22;">mz</span>/+ <span style="color: #a0522d;">%</span> 1) 10))
     (<span style="color: #228b22;">mz</span>/array-&gt;clj-seq (array (-- 1 3) [<span style="color: #008b8b;">:var</span> (-- -100 100)])))
</pre>
</div>

<p>
To make such higher-order programming working, in the resulting MiniZinc program the array element are accessed one by one.
</p>

<pre class="example">
array[1..3] of var -100..100: array9289;
constraint ((array9289[1] + 1) &lt; 10);
constraint ((array9289[2] + 1) &lt; 10);
constraint ((array9289[3] + 1) &lt; 10);
</pre>

<p>
To be fair, using the MiniZinc aggregation function <code>forall</code> the example above can also be expressed very concisely. 
</p>

<pre class="example">
array[1..3] of var -100..100: x;
constraint forall(i in 1..3)((x[i] + 1) &lt; 10);
</pre>

<p>
The difference is that the set of such aggregation functions and their capabilities is fixed in MiniZinc, but the clojure2minizinc user can define her own special-purpose higher-order function for applying constraints. 
</p>

<p>
<b>TODO: show example</b>
</p>

<p>
Of course, such higher-order functions can only depend on information available before the search starts. For example, it is not possible to define a filtering function as part of the constraint problem, which depends on the values of variables in the solution. Anyway, higher-order functions can apply constraints that depend on whether other constraints hold, using reified constraints such as implication. 
</p>
</div>
</div>
</div>
