doc/tutorial.org
** clojure2minizinc is Solver-Independent 

   The Constraint Programming community developed [[http://en.wikipedia.org/wiki/Constraint_programming#Logic_programming_based_constraint_logic_languages][many solvers]], and a considerable number of them extends a programming language directly. Such close integration has clear advantages. E.g., custom search strategies can be programmed using the full power of the host language (if the solver supports it).

   clojure2minizinc's inherits from MiniZinc the advantage that it is solver-independent: [[http://www.hakank.org/minizinc/][any solver supporting FlatZinc]] as input can be used. 


** Pitfalls of Constraint Programming Compared to Standard Clojure Programming 

    Constraint programming provides a very high level of abstraction for the programmer. However, this strength comes with a certain price. In particular, software using constraint programming can be hard to debug. Even worse, error messages by MiniZinc currently refer to line numbers of the generated MiniZinc code, not the clojure2minizinc code. However, constraint problem debuggers are not too helpful anyway. Often it is necessary to carefully analyse a model in order to understand why it does not work as intended. 

    A useful and easy debugging strategy is to disable a set of constraints and to enable them one by one again in order to find the problem. Another useful debugging aid is the search tree visualiser and interactive search tool =gist= provided by Gecode. It can be enabled with the =-mode= option. For more information see the [[http://www.gecode.org/doc-latest/MPG.pdf][Gecode tutorial]], p. 157ff. 

#+begin_src clojure 
(mz/minizinc aust :options ["-f fzn-gecode" "--fzn-flags '-mode gist'"])
#+end_src    

    *TODO: get code above working -- it works at the shell, but not yet in clojure2minizinc*


