doc/tutorial.html


<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> clojure2minizinc is Solver-Independent</h3>
<div class="outline-text-3" id="text-5-2">
<p>
The Constraint Programming community developed <a href="http://en.wikipedia.org/wiki/Constraint_programming#Logic_programming_based_constraint_logic_languages">many solvers</a>, and a considerable number of them extends a programming language directly. Such close integration has clear advantages. E.g., custom search strategies can be programmed using the full power of the host language (if the solver supports it).
</p>

<p>
clojure2minizinc's inherits from MiniZinc the advantage that it is solver-independent: <a href="http://www.hakank.org/minizinc/">any solver supporting FlatZinc</a> as input can be used. 
</p>
</div>
</div>


<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Pitfalls of Constraint Programming Compared to Standard Clojure Programming</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Constraint programming provides a very high level of abstraction for the programmer. However, this strength comes with a certain price. In particular, software using constraint programming can be hard to debug. Even worse, error messages by MiniZinc currently refer to line numbers of the generated MiniZinc code, not the clojure2minizinc code. However, constraint problem debuggers are not too helpful anyway. Often it is necessary to carefully analyse a model in order to understand why it does not work as intended. 
</p>

<p>
A useful and easy debugging strategy is to disable a set of constraints and to enable them one by one again in order to find the problem. Another useful debugging aid is the search tree visualiser and interactive search tool <code>gist</code> provided by Gecode. It can be enabled with the <code>-mode</code> option. For more information see the <a href="http://www.gecode.org/doc-latest/MPG.pdf">Gecode tutorial</a>, p. 157ff. 
</p>

<div class="org-src-container">

<pre class="src src-clojure">(<span style="color: #228b22;">mz</span>/minizinc aust <span style="color: #008b8b;">:options</span> [<span style="color: #8b2252;">"-f fzn-gecode"</span> <span style="color: #8b2252;">"--fzn-flags '-mode gist'"</span>])
</pre>
</div>

<p>
<b>TODO: get code above working &#x2013; it works at the shell, but not yet in clojure2minizinc</b>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Torsten Anders</p>
<p class="date">Created: 2014-09-30 Tue 19:40</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.2 (<a href="http://orgmode.org">Org</a> mode 8.2.7b)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>